Modulo 17-18-19-21/exemplo/app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.all
---
SELECT `produtos`.* FROM `produtos`

  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save
---
INSERT INTO `produtos` (`name`, `code`, `price`, `created_at`, `updated_at`) VALUES ('LG', '19283', 2000.0, '2021-06-17 13:37:13', '2021-06-17 13:37:13')

  def update
    respond_to do |format|
      if @produto.update(produto_params)
---
UPDATE `produtos` SET `name` = 'Samsung', `updated_at` = '2021-06-17 14:49:19' WHERE `produtos`.`id` = 4

  def destroy
    @produto.destroy
---
DELETE FROM `produtos` WHERE `produtos`.`id` = 1

    def set_produto
      @produto = Produto.find(params[:id])
---
SELECT  `produtos`.* FROM `produtos` WHERE `produtos`.`id` = 2 LIMIT 1