Modulo 23/3 - mercado/mercado/app/controllers/produtos_controller.rb

SELECT "produtos".* FROM "produtos"
---
  def index
    @produtos = Produto.all

INSERT INTO "produtos" ("nome", "preco", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "xilito"], ["preco", 2.5], ["quantidade", 5], ["created_at", "2021-06-18 19:36:18.003710"], ["updated_at", "2021-06-18 19:36:18.003710"]]
---
  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save

DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 1]]
---
  def destroy
    @produto.destroy

SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_produto
      @produto = Produto.find(params[:id])